cases/fishNetParallelDeformed3/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
300000
(
-1.0245
-0.9235
-0.8225
-0.7215
-0.6205
-0.5195
-0.4185
-0.3175
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-1.075
-1.075
-1.075
-1.075
-1.075
-1.075
-1.075
-1.075
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
14.075
14.075
14.075
14.075
14.075
14.075
14.075
14.075
...
)
;
    }
    boundaries
    {
        type            calculated;
        value           nonuniform List<scalar> 
36000
(
-1.0245
-1.0245
-1.0245
-1.0245
-1.0245
-1.0245
-1.0245
-1.0245
...
)
;
    }
}


// ************************************************************************* //
